Revit 2026 API

# ItemFactoryBaseNewDetailCurve Method

---

Creates a new detail curve element.

**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public DetailCurve NewDetailCurve(
	View view,
	Curve geometryCurve
)
```
```vb
Public Function NewDetailCurve (
	view As View,
	geometryCurve As Curve
) As DetailCurve
```
```cpp
public:
DetailCurve^ NewDetailCurve(
	View^ view,
	Curve^ geometryCurve
)
```
```fsharp
member NewDetailCurve :
        view : View *
        geometryCurve : Curve -> DetailCurve
```

#### Parameters

view View
     The view in which the detail curve is to be visible.
geometryCurve Curve
     The internal geometry curve for detail curve. It should be a bound curve.

#### Return Value

DetailCurve If successful a new detail curve element. Otherwise .

| Exception | Condition |
| --- | --- |
| ArgumentException | Thrown when curve is not in plane of the view |

Different type of detail curve element will be returned according to the type of geometry curve.

#### Reference

ItemFactoryBase Class

Autodesk.Revit.Creation Namespace